{
    "Section": {
        "Id": 1,
        "Data": [ 
            {"location":   1, "text":  "YOU ARE STANDING AT THE END OF A ROAD BEFORE A SMALL BRICK BUILDING."},
            {"location":   1, "text":  "AROUND YOU IS A FOREST.  A SMALL STREAM FLOWS OUT OF THE BUILDING AND"},
            {"location":   1, "text":  "DOWN A GULLY."},
            {"location":   2, "text":  "YOU HAVE WALKED UP A HILL, STILL IN THE FOREST.  THE ROAD SLOPES BACK"},
            {"location":   2, "text":  "DOWN THE OTHER SIDE OF THE HILL.  THERE IS A BUILDING IN THE DISTANCE."},
            {"location":   3, "text":  "YOU ARE INSIDE A BUILDING, A WELL HOUSE FOR A LARGE SPRING."},
            {"location":   4, "text":  "YOU ARE IN A VALLEY IN THE FOREST BESIDE A STREAM TUMBLING ALONG A"},
            {"location":   4, "text":  "ROCKY BED."},
            {"location":   5, "text":  "YOU ARE IN OPEN FOREST, WITH A DEEP VALLEY TO ONE SIDE."},
            {"location":   6, "text":  "YOU ARE IN OPEN FOREST NEAR BOTH A VALLEY AND A ROAD."},
            {"location":   7, "text":  "AT YOUR FEET ALL THE WATER OF THE STREAM SPLASHES INTO A 2-INCH SLIT"},
            {"location":   7, "text":  "IN THE ROCK.  DOWNSTREAM THE STREAMBED IS BARE ROCK."},
            {"location":   8, "text":  "YOU ARE IN A 20-FOOT DEPRESSION FLOORED WITH BARE DIRT.  SET INTO THE"},
            {"location":   8, "text":  "DIRT IS A STRONG STEEL GRATE MOUNTED IN CONCRETE.  A DRY STREAMBED"},
            {"location":   8, "text":  "LEADS INTO THE DEPRESSION."},
            {"location":   9, "text":  "YOU ARE IN A SMALL CHAMBER BENEATH A 3X3 STEEL GRATE TO THE SURFACE."},
            {"location":   9, "text":  "A LOW CRAWL OVER COBBLES LEADS INWARD TO THE WEST."},
            {"location":  10, "text":  "YOU ARE CRAWLING OVER COBBLES IN A LOW PASSAGE.  THERE IS A DIM LIGHT"},
            {"location":  10, "text":  "AT THE EAST END OF THE PASSAGE."},
            {"location":  11, "text":  "YOU ARE IN A DEBRIS ROOM FILLED WITH STUFF WASHED IN FROM THE SURFACE."},
            {"location":  11, "text":  "A LOW WIDE PASSAGE WITH COBBLES BECOMES PLUGGED WITH MUD AND DEBRIS"},
            {"location":  11, "text":  "HERE, BUT AN AWKWARD CANYON LEADS UPWARD AND WEST.  A NOTE ON THE WALL"},
            {"location":  11, "text":  "SAYS \"MAGIC WORD XYZZY\"."},
            {"location":  12, "text":  "YOU ARE IN AN AWKWARD SLOPING EAST/WEST CANYON."},
            {"location":  13, "text":  "YOU ARE IN A SPLENDID CHAMBER THIRTY FEET HIGH.  THE WALLS ARE FROZEN"},
            {"location":  13, "text":  "RIVERS OF ORANGE STONE.  AN AWKWARD CANYON AND A GOOD PASSAGE EXIT"},
            {"location":  13, "text":  "FROM EAST AND WEST SIDES OF THE CHAMBER."},
            {"location":  14, "text":  "AT YOUR FEET IS A SMALL PIT BREATHING TRACES OF WHITE MIST.  AN EAST"},
            {"location":  14, "text":  "PASSAGE ENDS HERE EXCEPT FOR A SMALL CRACK LEADING ON."},
            {"location":  15, "text":  "YOU ARE AT ONE END OF A VAST HALL STRETCHING FORWARD OUT OF SIGHT TO"},
            {"location":  15, "text":  "THE WEST.  THERE ARE OPENINGS TO EITHER SIDE.  NEARBY, A WIDE STONE"},
            {"location":  15, "text":  "STAIRCASE LEADS DOWNWARD.  THE HALL IS FILLED WITH WISPS OF WHITE MIST"},
            {"location":  15, "text":  "SWAYING TO AND FRO ALMOST AS IF ALIVE.  A COLD WIND BLOWS UP THE"},
            {"location":  15, "text":  "STAIRCASE.  THERE IS A PASSAGE AT THE TOP OF A DOME BEHIND YOU."},
            {"location":  16, "text":  "THE CRACK IS FAR TOO SMALL FOR YOU TO FOLLOW."},
            {"location":  17, "text":  "YOU ARE ON THE EAST BANK OF A FISSURE SLICING CLEAR ACROSS THE HALL."},
            {"location":  17, "text":  "THE MIST IS QUITE THICK HERE, AND THE FISSURE IS TOO WIDE TO JUMP."},
            {"location":  18, "text":  "THIS IS A LOW ROOM WITH A CRUDE NOTE ON THE WALL.  THE NOTE SAYS,"},
            {"location":  18, "text":  "\"YOU WON'T GET IT UP THE STEPS\"."},
            {"location":  19, "text":  "YOU ARE IN THE HALL OF THE MOUNTAIN KING, WITH PASSAGES OFF IN ALL"},
            {"location":  19, "text":  "DIRECTIONS."},
            {"location":  20, "text":  "YOU ARE AT THE BOTTOM OF THE PIT WITH A BROKEN NECK."},
            {"location":  21, "text":  "YOU DIDN'T MAKE IT."},
            {"location":  22, "text":  "THE DOME IS UNCLIMBABLE."},
            {"location":  23, "text":  "YOU ARE AT THE WEST END OF THE TWOPIT ROOM.  THERE IS A LARGE HOLE IN"},
            {"location":  23, "text":  "THE WALL ABOVE THE PIT AT THIS END OF THE ROOM."},
            {"location":  24, "text":  "YOU ARE AT THE BOTTOM OF THE EASTERN PIT IN THE TWOPIT ROOM.  THERE IS"},
            {"location":  24, "text":  "A SMALL POOL OF OIL IN ONE CORNER OF THE PIT."},
            {"location":  25, "text":  "YOU ARE AT THE BOTTOM OF THE WESTERN PIT IN THE TWOPIT ROOM.  THERE IS"},
            {"location":  25, "text":  "A LARGE HOLE IN THE WALL ABOUT 25 FEET ABOVE YOU."},
            {"location":  26, "text":  "YOU CLAMBER UP THE PLANT AND SCURRY THROUGH THE HOLE AT THE TOP."},
            {"location":  27, "text":  "YOU ARE ON THE WEST SIDE OF THE FISSURE IN THE HALL OF MISTS."},
            {"location":  28, "text":  "YOU ARE IN A LOW N/S PASSAGE AT A HOLE IN THE FLOOR.  THE HOLE GOES"},
            {"location":  28, "text":  "DOWN TO AN E/W PASSAGE."},
            {"location":  29, "text":  "YOU ARE IN THE SOUTH SIDE CHAMBER."},
            {"location":  30, "text":  "YOU ARE IN THE WEST SIDE CHAMBER OF THE HALL OF THE MOUNTAIN KING."},
            {"location":  30, "text":  "A PASSAGE CONTINUES WEST AND UP HERE."},
            {"location":  31, "text":  ">$<"},
            {"location":  32, "text":  "YOU CAN'T GET BY THE SNAKE."},
            {"location":  33, "text":  "YOU ARE IN A LARGE ROOM, WITH A PASSAGE TO THE SOUTH, A PASSAGE TO THE"},
            {"location":  33, "text":  "WEST, AND A WALL OF BROKEN ROCK TO THE EAST.  THERE IS A LARGE \"Y2\" ON"},
            {"location":  33, "text":  "A ROCK IN THE ROOM'S CENTER."},
            {"location":  34, "text":  "YOU ARE IN A JUMBLE OF ROCK, WITH CRACKS EVERYWHERE."},
            {"location":  35, "text":  "YOU'RE AT A LOW WINDOW OVERLOOKING A HUGE PIT, WHICH EXTENDS UP OUT OF"},
            {"location":  35, "text":  "SIGHT.  A FLOOR IS INDISTINCTLY VISIBLE OVER 50 FEET BELOW.  TRACES OF"},
            {"location":  35, "text":  "WHITE MIST COVER THE FLOOR OF THE PIT, BECOMING THICKER TO THE RIGHT."},
            {"location":  35, "text":  "MARKS IN THE DUST AROUND THE WINDOW WOULD SEEM TO INDICATE THAT"},
            {"location":  35, "text":  "SOMEONE HAS BEEN HERE RECENTLY.  DIRECTLY ACROSS THE PIT FROM YOU AND"},
            {"location":  35, "text":  "25 FEET AWAY THERE IS A SIMILAR WINDOW LOOKING INTO A LIGHTED ROOM.  A"},
            {"location":  35, "text":  "SHADOWY FIGURE CAN BE SEEN THERE PEERING BACK AT YOU."},
            {"location":  36, "text":  "YOU ARE IN A DIRTY BROKEN PASSAGE.  TO THE EAST IS A CRAWL.  TO THE"},
            {"location":  36, "text":  "WEST IS A LARGE PASSAGE.  ABOVE YOU IS A HOLE TO ANOTHER PASSAGE."},
            {"location":  37, "text":  "YOU ARE ON THE BRINK OF A SMALL CLEAN CLIMBABLE PIT.  A CRAWL LEADS"},
            {"location":  37, "text":  "WEST."},
            {"location":  38, "text":  "YOU ARE IN THE BOTTOM OF A SMALL PIT WITH A LITTLE STREAM, WHICH"},
            {"location":  38, "text":  "ENTERS AND EXITS THROUGH TINY SLITS."},
            {"location":  39, "text":  "YOU ARE IN A LARGE ROOM FULL OF DUSTY ROCKS.  THERE IS A BIG HOLE IN"},
            {"location":  39, "text":  "THE FLOOR.  THERE ARE CRACKS EVERYWHERE, AND A PASSAGE LEADING EAST."},
            {"location":  40, "text":  "YOU HAVE CRAWLED THROUGH A VERY LOW WIDE PASSAGE PARALLEL TO AND NORTH"},
            {"location":  40, "text":  "OF THE HALL OF MISTS."},
            {"location":  41, "text":  "YOU ARE AT THE WEST END OF HALL OF MISTS.  A LOW WIDE CRAWL CONTINUES"},
            {"location":  41, "text":  "WEST AND ANOTHER GOES NORTH.  TO THE SOUTH IS A LITTLE PASSAGE 6 FEET"},
            {"location":  41, "text":  "OFF THE FLOOR."},
            {"location":  42, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  43, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  44, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  45, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  46, "text":  "DEAD END"},
            {"location":  47, "text":  "DEAD END"},
            {"location":  48, "text":  "DEAD END"},
            {"location":  49, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  50, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  51, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  52, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  53, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  54, "text":  "DEAD END"},
            {"location":  55, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  56, "text":  "DEAD END"},
            {"location":  57, "text":  "YOU ARE ON THE BRINK OF A THIRTY FOOT PIT WITH A MASSIVE ORANGE COLUMN"},
            {"location":  57, "text":  "DOWN ONE WALL.  YOU COULD CLIMB DOWN HERE BUT YOU COULD NOT GET BACK"},
            {"location":  57, "text":  "UP.  THE MAZE CONTINUES AT THIS LEVEL."},
            {"location":  58, "text":  "DEAD END"},
            {"location":  59, "text":  "YOU HAVE CRAWLED THROUGH A VERY LOW WIDE PASSAGE PARALLEL TO AND NORTH"},
            {"location":  59, "text":  "OF THE HALL OF MISTS."},
            {"location":  60, "text":  "YOU ARE AT THE EAST END OF A VERY LONG HALL APPARENTLY WITHOUT SIDE"},
            {"location":  60, "text":  "CHAMBERS.  TO THE EAST A LOW WIDE CRAWL SLANTS UP.  TO THE NORTH A"},
            {"location":  60, "text":  "ROUND TWO FOOT HOLE SLANTS DOWN."},
            {"location":  61, "text":  "YOU ARE AT THE WEST END OF A VERY LONG FEATURELESS HALL.  THE HALL"},
            {"location":  61, "text":  "JOINS UP WITH A NARROW NORTH/SOUTH PASSAGE."},
            {"location":  62, "text":  "YOU ARE AT A CROSSOVER OF A HIGH N/S PASSAGE AND A LOW E/W ONE."},
            {"location":  63, "text":  "DEAD END"},
            {"location":  64, "text":  "YOU ARE AT A COMPLEX JUNCTION.  A LOW HANDS AND KNEES PASSAGE FROM THE"},
            {"location":  64, "text":  "NORTH JOINS A HIGHER CRAWL FROM THE EAST TO MAKE A WALKING PASSAGE"},
            {"location":  64, "text":  "GOING WEST.  THERE IS ALSO A LARGE ROOM ABOVE.  THE AIR IS DAMP HERE."},
            {"location":  65, "text":  "YOU ARE IN BEDQUILT, A LONG EAST/WEST PASSAGE WITH HOLES EVERYWHERE."},
            {"location":  65, "text":  "TO EXPLORE AT RANDOM SELECT NORTH, SOUTH, UP, OR DOWN."},
            {"location":  66, "text":  "YOU ARE IN A ROOM WHOSE WALLS RESEMBLE SWISS CHEESE.  OBVIOUS PASSAGES"},
            {"location":  66, "text":  "GO WEST, EAST, NE, AND NW.  PART OF THE ROOM IS OCCUPIED BY A LARGE"},
            {"location":  66, "text":  "BEDROCK BLOCK."},
            {"location":  67, "text":  "YOU ARE AT THE EAST END OF THE TWOPIT ROOM.  THE FLOOR HERE IS"},
            {"location":  67, "text":  "LITTERED WITH THIN ROCK SLABS, WHICH MAKE IT EASY TO DESCEND THE PITS."},
            {"location":  67, "text":  "THERE IS A PATH HERE BYPASSING THE PITS TO CONNECT PASSAGES FROM EAST"},
            {"location":  67, "text":  "AND WEST.  THERE ARE HOLES ALL OVER, BUT THE ONLY BIG ONE IS ON THE"},
            {"location":  67, "text":  "WALL DIRECTLY OVER THE WEST PIT WHERE YOU CAN'T GET TO IT."},
            {"location":  68, "text":  "YOU ARE IN A LARGE LOW CIRCULAR CHAMBER WHOSE FLOOR IS AN IMMENSE SLAB"},
            {"location":  68, "text":  "FALLEN FROM THE CEILING (SLAB ROOM).  EAST AND WEST THERE ONCE WERE"},
            {"location":  68, "text":  "LARGE PASSAGES, BUT THEY ARE NOW FILLED WITH BOULDERS.  LOW SMALL"},
            {"location":  68, "text":  "PASSAGES GO NORTH AND SOUTH, AND THE SOUTH ONE QUICKLY BENDS WEST"},
            {"location":  68, "text":  "AROUND THE BOULDERS."},
            {"location":  69, "text":  "YOU ARE IN A SECRET N/S CANYON ABOVE A LARGE ROOM."},
            {"location":  70, "text":  "YOU ARE IN A SECRET N/S CANYON ABOVE A SIZABLE PASSAGE."},
            {"location":  71, "text":  "YOU ARE IN A SECRET CANYON AT A JUNCTION OF THREE CANYONS, BEARING"},
            {"location":  71, "text":  "NORTH, SOUTH, AND SE.  THE NORTH ONE IS AS TALL AS THE OTHER TWO"},
            {"location":  71, "text":  "COMBINED."},
            {"location":  72, "text":  "YOU ARE IN A LARGE LOW ROOM.  CRAWLS LEAD NORTH, SE, AND SW."},
            {"location":  73, "text":  "DEAD END CRAWL."},
            {"location":  74, "text":  "YOU ARE IN A SECRET CANYON WHICH HERE RUNS E/W.  IT CROSSES OVER A"},
            {"location":  74, "text":  "VERY TIGHT CANYON 15 FEET BELOW.  IF YOU GO DOWN YOU MAY NOT BE ABLE"},
            {"location":  74, "text":  "TO GET BACK UP."},
            {"location":  75, "text":  "YOU ARE AT A WIDE PLACE IN A VERY TIGHT N/S CANYON."},
            {"location":  76, "text":  "THE CANYON HERE BECOMES TOO TIGHT TO GO FURTHER SOUTH."},
            {"location":  77, "text":  "YOU ARE IN A TALL E/W CANYON.  A LOW TIGHT CRAWL GOES 3 FEET NORTH AND"},
            {"location":  77, "text":  "SEEMS TO OPEN UP."},
            {"location":  78, "text":  "THE CANYON RUNS INTO A MASS OF BOULDERS -- DEAD END."},
            {"location":  79, "text":  "THE STREAM FLOWS OUT THROUGH A PAIR OF 1 FOOT DIAMETER SEWER PIPES."},
            {"location":  79, "text":  "IT WOULD BE ADVISABLE TO USE THE EXIT."},
            {"location":  80, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  81, "text":  "DEAD END"},
            {"location":  82, "text":  "DEAD END"},
            {"location":  83, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  84, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  85, "text":  "DEAD END"},
            {"location":  86, "text":  "DEAD END"},
            {"location":  87, "text":  "YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL ALIKE."},
            {"location":  88, "text":  "YOU ARE IN A LONG, NARROW CORRIDOR STRETCHING OUT OF SIGHT TO THE"},
            {"location":  88, "text":  "WEST.  AT THE EASTERN END IS A HOLE THROUGH WHICH YOU CAN SEE A"},
            {"location":  88, "text":  "PROFUSION OF LEAVES."},
            {"location":  89, "text":  "THERE IS NOTHING HERE TO CLIMB.  USE \"UP\" OR \"OUT\" TO LEAVE THE PIT."},
            {"location":  90, "text":  "YOU HAVE CLIMBED UP THE PLANT AND OUT OF THE PIT."},
            {"location":  91, "text":  "YOU ARE AT THE TOP OF A STEEP INCLINE ABOVE A LARGE ROOM.  YOU COULD"},
            {"location":  91, "text":  "CLIMB DOWN HERE, BUT YOU WOULD NOT BE ABLE TO CLIMB UP.  THERE IS A"},
            {"location":  91, "text":  "PASSAGE LEADING BACK TO THE NORTH."},
            {"location":  92, "text":  "YOU ARE IN THE GIANT ROOM.  THE CEILING HERE IS TOO HIGH UP FOR YOUR"},
            {"location":  92, "text":  "LAMP TO SHOW IT.  CAVERNOUS PASSAGES LEAD EAST, NORTH, AND SOUTH.  ON"},
            {"location":  92, "text":  "THE WEST WALL IS SCRAWLED THE INSCRIPTION, \"FEE FIE FOE FOO\" [SIC]."},
            {"location":  93, "text":  "THE PASSAGE HERE IS BLOCKED BY A RECENT CAVE-IN."},
            {"location":  94, "text":  "YOU ARE AT ONE END OF AN IMMENSE NORTH/SOUTH PASSAGE."},
            {"location":  95, "text":  "YOU ARE IN A MAGNIFICENT CAVERN WITH A RUSHING STREAM, WHICH CASCADES"},
            {"location":  95, "text":  "OVER A SPARKLING WATERFALL INTO A ROARING WHIRLPOOL WHICH DISAPPEARS"},
            {"location":  95, "text":  "THROUGH A HOLE IN THE FLOOR.  PASSAGES EXIT TO THE SOUTH AND WEST."},
            {"location":  96, "text":  "YOU ARE IN THE SOFT ROOM.  THE WALLS ARE COVERED WITH HEAVY CURTAINS,"},
            {"location":  96, "text":  "THE FLOOR WITH A THICK PILE CARPET.  MOSS COVERS THE CEILING."},
            {"location":  97, "text":  "THIS IS THE ORIENTAL ROOM.  ANCIENT ORIENTAL CAVE DRAWINGS COVER THE"},
            {"location":  97, "text":  "WALLS.  A GENTLY SLOPING PASSAGE LEADS UPWARD TO THE NORTH, ANOTHER"},
            {"location":  97, "text":  "PASSAGE LEADS SE, AND A HANDS AND KNEES CRAWL LEADS WEST."},
            {"location":  98, "text":  "YOU ARE FOLLOWING A WIDE PATH AROUND THE OUTER EDGE OF A LARGE CAVERN."},
            {"location":  98, "text":  "FAR BELOW, THROUGH A HEAVY WHITE MIST, STRANGE SPLASHING NOISES CAN BE"},
            {"location":  98, "text":  "HEARD.  THE MIST RISES UP THROUGH A FISSURE IN THE CEILING.  THE PATH"},
            {"location":  98, "text":  "EXITS TO THE SOUTH AND WEST."},
            {"location":  99, "text":  "YOU ARE IN AN ALCOVE.  A SMALL NW PATH SEEMS TO WIDEN AFTER A SHORT"},
            {"location":  99, "text":  "DISTANCE.  AN EXTREMELY TIGHT TUNNEL LEADS EAST.  IT LOOKS LIKE A VERY"},
            {"location":  99, "text":  "TIGHT SQUEEZE.  AN EERIE LIGHT CAN BE SEEN AT THE OTHER END."},
            {"location": 100, "text": 	"YOU'RE IN A SMALL CHAMBER LIT BY AN EERIE GREEN LIGHT.  AN EXTREMELY"},
            {"location": 100, "text": 	"NARROW TUNNEL EXITS TO THE WEST.  A DARK CORRIDOR LEADS NE."},
            {"location": 101, "text": 	"YOU'RE IN THE DARK-ROOM.  A CORRIDOR LEADING SOUTH IS THE ONLY EXIT."},
            {"location": 102, "text": 	"YOU ARE IN AN ARCHED HALL.  A CORAL PASSAGE ONCE CONTINUED UP AND EAST"},
            {"location": 102, "text": 	"FROM HERE, BUT IS NOW BLOCKED BY DEBRIS.  THE AIR SMELLS OF SEA WATER."},
            {"location": 103, "text": 	"YOU'RE IN A LARGE ROOM CARVED OUT OF SEDIMENTARY ROCK.  THE FLOOR AND"},
            {"location": 103, "text": 	"WALLS ARE LITTERED WITH BITS OF SHELLS IMBEDDED IN THE STONE.  A"},
            {"location": 103, "text": 	"SHALLOW PASSAGE PROCEEDS DOWNWARD, AND A SOMEWHAT STEEPER ONE LEADS"},
            {"location": 103, "text": 	"UP.  A LOW HANDS AND KNEES PASSAGE ENTERS FROM THE SOUTH."},
            {"location": 104, "text": 	"YOU ARE IN A LONG SLOPING CORRIDOR WITH RAGGED SHARP WALLS."},
            {"location": 105, "text": 	"YOU ARE IN A CUL-DE-SAC ABOUT EIGHT FEET ACROSS."},
            {"location": 106, "text": 	"YOU ARE IN AN ANTEROOM LEADING TO A LARGE PASSAGE TO THE EAST.  SMALL"},
            {"location": 106, "text": 	"PASSAGES GO WEST AND UP.  THE REMNANTS OF RECENT DIGGING ARE EVIDENT."},
            {"location": 106, "text": 	"A SIGN IN MIDAIR HERE SAYS \"CAVE UNDER CONSTRUCTION BEYOND THIS POINT.\""},
            {"location": 106, "text": 	"PROCEED AT OWN RISK.  [WITT CONSTRUCTION COMPANY]"},
            {"location": 107, "text": 	"YOU ARE IN A MAZE OF TWISTY LITTLE PASSAGES, ALL DIFFERENT."},
            {"location": 108, "text": 	"YOU ARE AT WITT'S END.  PASSAGES LEAD OFF IN *ALL* DIRECTIONS."},
            {"location": 109, "text": 	"YOU ARE IN A NORTH/SOUTH CANYON ABOUT 25 FEET ACROSS.  THE FLOOR IS"},
            {"location": 109, "text": 	"COVERED BY WHITE MIST SEEPING IN FROM THE NORTH.  THE WALLS EXTEND"},
            {"location": 109, "text": 	"UPWARD FOR WELL OVER 100 FEET.  SUSPENDED FROM SOME UNSEEN POINT FAR"},
            {"location": 109, "text": 	"ABOVE YOU, AN ENORMOUS TWO-SIDED MIRROR IS HANGING PARALLEL TO AND"},
            {"location": 109, "text": 	"MIDWAY BETWEEN THE CANYON WALLS.  (THE MIRROR IS OBVIOUSLY PROVIDED"},
            {"location": 109, "text": 	"FOR THE USE OF THE DWARVES, WHO AS YOU KNOW, ARE EXTREMELY VAIN.)  A"},
            {"location": 109, "text": 	"SMALL WINDOW CAN BE SEEN IN EITHER WALL, SOME FIFTY FEET UP."},
            {"location": 110, "text": 	"YOU'RE AT A LOW WINDOW OVERLOOKING A HUGE PIT, WHICH EXTENDS UP OUT OF"},
            {"location": 110, "text": 	"SIGHT.  A FLOOR IS INDISTINCTLY VISIBLE OVER 50 FEET BELOW.  TRACES OF"},
            {"location": 110, "text": 	"WHITE MIST COVER THE FLOOR OF THE PIT, BECOMING THICKER TO THE LEFT."},
            {"location": 110, "text": 	"MARKS IN THE DUST AROUND THE WINDOW WOULD SEEM TO INDICATE THAT"},
            {"location": 110, "text": 	"SOMEONE HAS BEEN HERE RECENTLY.  DIRECTLY ACROSS THE PIT FROM YOU AND"},
            {"location": 110, "text": 	"25 FEET AWAY THERE IS A SIMILAR WINDOW LOOKING INTO A LIGHTED ROOM.  A"},
            {"location": 110, "text": 	"SHADOWY FIGURE CAN BE SEEN THERE PEERING BACK AT YOU."},
            {"location": 111, "text": 	"A LARGE STALACTITE EXTENDS FROM THE ROOF AND ALMOST REACHES THE FLOOR"},
            {"location": 111, "text": 	"BELOW.  YOU COULD CLIMB DOWN IT, AND JUMP FROM IT TO THE FLOOR, BUT"},
            {"location": 111, "text": 	"HAVING DONE SO YOU WOULD BE UNABLE TO REACH IT TO CLIMB BACK UP."},
            {"location": 112, "text": 	"YOU ARE IN A LITTLE MAZE OF TWISTING PASSAGES, ALL DIFFERENT."},
            {"location": 113, "text": 	"YOU ARE AT THE EDGE OF A LARGE UNDERGROUND RESERVOIR.  AN OPAQUE CLOUD"},
            {"location": 113, "text": 	"OF WHITE MIST FILLS THE ROOM AND RISES RAPIDLY UPWARD.  THE LAKE IS"},
            {"location": 113, "text": 	"FED BY A STREAM, WHICH TUMBLES OUT OF A HOLE IN THE WALL ABOUT 10 FEET"},
            {"location": 113, "text": 	"OVERHEAD AND SPLASHES NOISILY INTO THE WATER SOMEWHERE WITHIN THE"},
            {"location": 113, "text": 	"MIST.  THE ONLY PASSAGE GOES BACK TOWARD THE SOUTH."},
            {"location": 114, "text": 	"DEAD END"},
            {"location": 115, "text": 	"YOU ARE AT THE NORTHEAST END OF AN IMMENSE ROOM, EVEN LARGER THAN THE"},
            {"location": 115, "text": 	"GIANT ROOM.  IT APPEARS TO BE A REPOSITORY FOR THE \"ADVENTURE\""},
            {"location": 115, "text": 	"PROGRAM.  MASSIVE TORCHES FAR OVERHEAD BATHE THE ROOM WITH SMOKY"},
            {"location": 115, "text": 	"YELLOW LIGHT.  SCATTERED ABOUT YOU CAN BE SEEN A PILE OF BOTTLES (ALL"},
            {"location": 115, "text": 	"OF THEM EMPTY), A NURSERY OF YOUNG BEANSTALKS MURMURING QUIETLY, A BED"},
            {"location": 115, "text": 	"OF OYSTERS, A BUNDLE OF BLACK RODS WITH RUSTY STARS ON THEIR ENDS, AND"},
            {"location": 115, "text": 	"A COLLECTION OF BRASS LANTERNS.  OFF TO ONE SIDE A GREAT MANY DWARVES"},
            {"location": 115, "text": 	"ARE SLEEPING ON THE FLOOR, SNORING LOUDLY.  A SIGN NEARBY READS: \"DO"},
            {"location": 115, "text": 	"NOT DISTURB THE DWARVES!\"  AN IMMENSE MIRROR IS HANGING AGAINST ONE"},
            {"location": 115, "text": 	"WALL, AND STRETCHES TO THE OTHER END OF THE ROOM, WHERE VARIOUS OTHER"},
            {"location": 115, "text": 	"SUNDRY OBJECTS CAN BE GLIMPSED DIMLY IN THE DISTANCE."},
            {"location": 116, "text": 	"YOU ARE AT THE SOUTHWEST END OF THE REPOSITORY.  TO ONE SIDE IS A PIT"},
            {"location": 116, "text": 	"FULL OF FIERCE GREEN SNAKES.  ON THE OTHER SIDE IS A ROW OF SMALL"},
            {"location": 116, "text": 	"WICKER CAGES, EACH OF WHICH CONTAINS A LITTLE SULKING BIRD.  IN ONE"},
            {"location": 116, "text": 	"CORNER IS A BUNDLE OF BLACK RODS WITH RUSTY MARKS ON THEIR ENDS.  A"},
            {"location": 116, "text": 	"LARGE NUMBER OF VELVET PILLOWS ARE SCATTERED ABOUT ON THE FLOOR.  A"},
            {"location": 116, "text": 	"VAST MIRROR STRETCHES OFF TO THE NORTHEAST.  AT YOUR FEET IS A LARGE"},
            {"location": 116, "text": 	"STEEL GRATE, NEXT TO WHICH IS A SIGN WHICH READS, 'TREASURE VAULT."},
            {"location": 116, "text": 	"KEYS IN MAIN OFFICE.'"},
            {"location": 117, "text": 	"YOU ARE ON ONE SIDE OF A LARGE, DEEP CHASM.  A HEAVY WHITE MIST RISING"},
            {"location": 117, "text": 	"UP FROM BELOW OBSCURES ALL VIEW OF THE FAR SIDE.  A SW PATH LEADS AWAY"},
            {"location": 117, "text": 	"FROM THE CHASM INTO A WINDING CORRIDOR."},
            {"location": 118, "text": 	"YOU ARE IN A LONG WINDING CORRIDOR SLOPING OUT OF SIGHT IN BOTH"},
            {"location": 118, "text": 	"DIRECTIONS."},
            {"location": 119, "text": 	"YOU ARE IN A SECRET CANYON WHICH EXITS TO THE NORTH AND EAST."},
            {"location": 120, "text": 	"YOU ARE IN A SECRET CANYON WHICH EXITS TO THE NORTH AND EAST."},
            {"location": 121, "text": 	"YOU ARE IN A SECRET CANYON WHICH EXITS TO THE NORTH AND EAST."},
            {"location": 122, "text": 	"YOU ARE ON THE FAR SIDE OF THE CHASM.  A NE PATH LEADS AWAY FROM THE"},
            {"location": 122, "text": 	"CHASM ON THIS SIDE."},
            {"location": 123, "text": 	"YOU'RE IN A LONG EAST/WEST CORRIDOR.  A FAINT RUMBLING NOISE CAN BE"},
            {"location": 123, "text": 	"HEARD IN THE DISTANCE."},
            {"location": 124, "text": 	"THE PATH FORKS HERE.  THE LEFT FORK LEADS NORTHEAST.  A DULL RUMBLING"},
            {"location": 124, "text": 	"SEEMS TO GET LOUDER IN THAT DIRECTION.  THE RIGHT FORK LEADS SOUTHEAST"},
            {"location": 124, "text": 	"DOWN A GENTLE SLOPE.  THE MAIN CORRIDOR ENTERS FROM THE WEST."},
            {"location": 125, "text": 	"THE WALLS ARE QUITE WARM HERE.  FROM THE NORTH CAN BE HEARD A STEADY"},
            {"location": 125, "text": 	"ROAR, SO LOUD THAT THE ENTIRE CAVE SEEMS TO BE TREMBLING.  ANOTHER"},
            {"location": 125, "text": 	"PASSAGE LEADS SOUTH, AND A LOW CRAWL GOES EAST."},
            {"location": 126, "text": 	"YOU ARE ON THE EDGE OF A BREATH-TAKING VIEW.  FAR BELOW YOU IS AN"},
            {"location": 126, "text": 	"ACTIVE VOLCANO, FROM WHICH GREAT GOUTS OF MOLTEN LAVA COME SURGING"},
            {"location": 126, "text": 	"OUT, CASCADING BACK DOWN INTO THE DEPTHS.  THE GLOWING ROCK FILLS THE"},
            {"location": 126, "text": 	"FARTHEST REACHES OF THE CAVERN WITH A BLOOD-RED GLARE, GIVING EVERY-"},
            {"location": 126, "text": 	"THING AN EERIE, MACABRE APPEARANCE.  THE AIR IS FILLED WITH FLICKERING"},
            {"location": 126, "text": 	"SPARKS OF ASH AND A HEAVY SMELL OF BRIMSTONE.  THE WALLS ARE HOT TO"},
            {"location": 126, "text": 	"THE TOUCH, AND THE THUNDERING OF THE VOLCANO DROWNS OUT ALL OTHER"},
            {"location": 126, "text": 	"SOUNDS.  EMBEDDED IN THE JAGGED ROOF FAR OVERHEAD ARE MYRIAD TWISTED"},
            {"location": 126, "text": 	"FORMATIONS COMPOSED OF PURE WHITE ALABASTER, WHICH SCATTER THE MURKY"},
            {"location": 126, "text": 	"LIGHT INTO SINISTER APPARITIONS UPON THE WALLS.  TO ONE SIDE IS A DEEP"},
            {"location": 126, "text": 	"GORGE, FILLED WITH A BIZARRE CHAOS OF TORTURED ROCK WHICH SEEMS TO"},
            {"location": 126, "text": 	"HAVE BEEN CRAFTED BY THE DEVIL HIMSELF.  AN IMMENSE RIVER OF FIRE"},
            {"location": 126, "text": 	"CRASHES OUT FROM THE DEPTHS OF THE VOLCANO, BURNS ITS WAY THROUGH THE"},
            {"location": 126, "text": 	"GORGE, AND PLUMMETS INTO A BOTTOMLESS PIT FAR OFF TO YOUR LEFT.  TO"},
            {"location": 126, "text": 	"THE RIGHT, AN IMMENSE GEYSER OF BLISTERING STEAM ERUPTS CONTINUOUSLY"},
            {"location": 126, "text": 	"FROM A BARREN ISLAND IN THE CENTER OF A SULFUROUS LAKE, WHICH BUBBLES"},
            {"location": 126, "text": 	"OMINOUSLY.  THE FAR RIGHT WALL IS AFLAME WITH AN INCANDESCENCE OF ITS"},
            {"location": 126, "text": 	"OWN, WHICH LENDS AN ADDITIONAL INFERNAL SPLENDOR TO THE ALREADY"},
            {"location": 126, "text": 	"HELLISH SCENE.  A DARK, FOREBODING PASSAGE EXITS TO THE SOUTH."},
            {"location": 127, "text": 	"YOU ARE IN A SMALL CHAMBER FILLED WITH LARGE BOULDERS.  THE WALLS ARE"},
            {"location": 127, "text": 	"VERY WARM, CAUSING THE AIR IN THE ROOM TO BE ALMOST STIFLING FROM THE"},
            {"location": 127, "text": 	"HEAT.  THE ONLY EXIT IS A CRAWL HEADING WEST, THROUGH WHICH IS COMING"},
            {"location": 127, "text": 	"A LOW RUMBLING."},
            {"location": 128, "text": 	"YOU ARE WALKING ALONG A GENTLY SLOPING NORTH/SOUTH PASSAGE LINED WITH"},
            {"location": 128, "text": 	"ODDLY SHAPED LIMESTONE FORMATIONS."},
            {"location": 129, "text": 	"YOU ARE STANDING AT THE ENTRANCE TO A LARGE, BARREN ROOM.  A SIGN"},
            {"location": 129, "text": 	"POSTED ABOVE THE ENTRANCE READS:  \"CAUTION!  BEAR IN ROOM!\""},
            {"location": 130, "text": 	"YOU ARE INSIDE A BARREN ROOM.  THE CENTER OF THE ROOM IS COMPLETELY"},
            {"location": 130, "text": 	"EMPTY EXCEPT FOR SOME DUST.  MARKS IN THE DUST LEAD AWAY TOWARD THE"},
            {"location": 130, "text": 	"FAR END OF THE ROOM.  THE ONLY EXIT IS THE WAY YOU CAME IN."},
            {"location": 131, "text": 	"YOU ARE IN A MAZE OF TWISTING LITTLE PASSAGES, ALL DIFFERENT."},
            {"location": 132, "text": 	"YOU ARE IN A LITTLE MAZE OF TWISTY PASSAGES, ALL DIFFERENT."},
            {"location": 133, "text": 	"YOU ARE IN A TWISTING MAZE OF LITTLE PASSAGES, ALL DIFFERENT."},
            {"location": 134, "text": 	"YOU ARE IN A TWISTING LITTLE MAZE OF PASSAGES, ALL DIFFERENT."},
            {"location": 135, "text": 	"YOU ARE IN A TWISTY LITTLE MAZE OF PASSAGES, ALL DIFFERENT."},
            {"location": 136, "text": 	"YOU ARE IN A TWISTY MAZE OF LITTLE PASSAGES, ALL DIFFERENT."},
            {"location": 137, "text": 	"YOU ARE IN A LITTLE TWISTY MAZE OF PASSAGES, ALL DIFFERENT."},
            {"location": 138, "text": 	"YOU ARE IN A MAZE OF LITTLE TWISTING PASSAGES, ALL DIFFERENT."},
            {"location": 139, "text": 	"YOU ARE IN A MAZE OF LITTLE TWISTY PASSAGES, ALL DIFFERENT."},
            {"location": 140, "text": 	"DEAD END"}
            ],
        "_comment": "old section terminator: -1  END"
    }
}